Invoice Service Sample Payloads.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:typ="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/types/"
xmlns:inv="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/"
xmlns:tran="http://xmlns.oracle.com/apps/financials/receivables/transactions/autoInvoices/model/flex/TransactionInterfaceGdf/"
xmlns:tran1="http://xmlns.oracle.com/apps/financials/receivables/transactions/autoInvoices/model/flex/TransactionLineInterfaceGdf/"
xmlns:tran2="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionLineInterfaceLineDff/"
xmlns:tran3="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionInterfaceLinkToDff/"
xmlns:tran4="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionInterfaceReferenceDff/"
xmlns:tran5="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionLineDff/"
xmlns:tran6="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionInterfaceHeaderDff/"
xmlns:typ1="http://xmlns.oracle.com/adf/svc/types/">
<soapenv:Header/>
<soapenv:Body>
<typ:processInterfaceLine>
<typ:changeOperation>Create</typ:changeOperation>
<!--Zero or more repetitions:-->
<typ:interfaceLine>
<!--Optional:-->
<inv:OrgId>204</inv:OrgId>
<inv:Amount currencyCode="USD">-1000</inv:Amount>
<inv:BatchSourceName>AR_Trans Source_02C-Dir</inv:BatchSourceName>
<inv:TrxDate>2019-05-23</inv:TrxDate>
<inv:CurrencyCode>USD</inv:CurrencyCode>
<inv:ConversionType>User</inv:ConversionType>
<inv:CustomerTrxTypeName>Credit Memo</inv:CustomerTrxTypeName>
<inv:GlDate>2019-05-23</inv:GlDate>
<inv:LineType>LINE</inv:LineType>
<inv:Description>Credit Testing 1</inv:Description>
<inv:ReferenceLineId>300100180959754</inv:ReferenceLineId>
<inv:OrigSystemBillAddressReference>1033</inv:OrigSystemBillAddressReference>
<inv:OrigSystemBillCustomerReference>1005</inv:OrigSystemBillCustomerReference>
<inv:OrigSystemShipAddressReference>1033</inv:OrigSystemShipAddressReference>
<inv:OrigSystemShipCustomerReference>1005</inv:OrigSystemShipCustomerReference>
<inv:Quantity unitCode="Ea">-1</inv:Quantity>
<inv:TrxNumber>CM23052019_2</inv:TrxNumber>
<inv:UOMName>Each</inv:UOMName>
</typ:interfaceLine>
<typ:processControl>
<typ1:partialFailureAllowed>false</typ1:partialFailureAllowed>
</typ:processControl>
</typ:processInterfaceLine>
</soapenv:Body>
</soapenv:Envelope>